In [1]:
%load_ext sql
%sql mysql+pymysql://root:root@127.0.0.1/test

In [5]:
%%sql

show databases;

 * mysql+pymysql://root:***@127.0.0.1/test
8 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sql_practice',),
 ('sys',),
 ('test',),
 ('world',)]

In [6]:
%%sql

create database constraint_in_sql;

 * mysql+pymysql://root:***@127.0.0.1/test
1 rows affected.

[]

In [8]:
%%sql

use constraint_in_sql;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [9]:
%%sql

show tables;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [10]:
%%sql

/*

SQL Constraints :

NOT NULL     - Ensures that a column cannot have a NULL value
UNIQUE       - Ensures that all values in a column are different
PRIMARY KEY  - A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table
FOREIGN KEY  - Prevents actions that would destroy links between tables
CHECK        - Ensures that the values in a column satisfies a specific condition
DEFAULT      - Sets a default value for a column if no value is specified
CREATE INDEX - Used to create and retrieve data from the database very quickly

*/

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [13]:
%%sql

#Primary Key
create table Primary_Key(
    s_id int primary key
);

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [14]:
%%sql

insert into Primary_Key(s_id)
Values
    (1),(2),(3);

 * mysql+pymysql://root:***@127.0.0.1/test
3 rows affected.

[]

In [15]:
%%sql

select * from Primary_Key;

 * mysql+pymysql://root:***@127.0.0.1/test
3 rows affected.

[(1,), (2,), (3,)]

In [16]:
%%sql

# What happens if i insert redudant data in the table while it's constrain is primary key

insert into Primary_Key(s_id)
Values
    (1);

 * mysql+pymysql://root:***@127.0.0.1/test
(pymysql.err.IntegrityError) (1062, "Duplicate entry '1' for key 'primary_key.PRIMARY'")
[SQL: # What happens if i insert redudant data in the table while it's constrain is primary key

insert into Primary_Key(s_id)
Values
    (1);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [17]:
%%sql

desc Primary_Key;

 * mysql+pymysql://root:***@127.0.0.1/test
1 rows affected.

[('s_id', 'int', 'NO', 'PRI', None, '')]

In [42]:
%%sql

# composite Primary Key => More than 2 primary keys 
drop table Composite_Primary_Key; 
create table Composite_Primary_Key (
    stud_name varchar(20),
    aadhar_no varchar(20),
    pan_no varchar(20),
    primary key(aadhar_no, pan_no)
);

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.
0 rows affected.

[]

In [43]:
%%sql

ALTER TABLE Composite_Primary_Key
MODIFY stud_name VARCHAR(50);

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [44]:
%%sql

INSERT INTO Composite_Primary_Key (stud_name, aadhar_no, pan_no) 
VALUES
    ('Pragateesh', 'AADHAR001', 'PAN001'),
    ('Dhiraj', 'AADHAR002', 'PAN002'),
    ('Muppli', 'AADHAR003', 'PAN003'),
    ('Santhosh', 'AADHAR004', 'PAN004'),
    ('Mani', 'AADHAR005', 'PAN005');

 * mysql+pymysql://root:***@127.0.0.1/test
5 rows affected.

[]

In [57]:
%%sql

INSERT INTO Composite_Primary_Key (stud_name, aadhar_no, pan_no) 
VALUES
('Pragateesh', 'AADHAR001', 'PAN008');

 * mysql+pymysql://root:***@127.0.0.1/test
1 rows affected.

[]

In [45]:
%%sql 

desc Composite_Primary_Key;

 * mysql+pymysql://root:***@127.0.0.1/test
3 rows affected.

[('stud_name', 'varchar(50)', 'YES', '', None, ''),
 ('aadhar_no', 'varchar(20)', 'NO', 'PRI', None, ''),
 ('pan_no', 'varchar(20)', 'NO', 'PRI', None, '')]

In [58]:
%%sql

select * from Composite_Primary_Key;

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('Pragateesh', 'AADHAR001', 'PAN001'),
 ('Pragateesh', 'AADHAR001', 'PAN008'),
 ('Dhiraj', 'AADHAR002', 'PAN002'),
 ('Muppli', 'AADHAR003', 'PAN003'),
 ('Santhosh', 'AADHAR004', 'PAN004'),
 ('Mani', 'AADHAR005', 'PAN005')]

In [47]:
%%sql

# unique ( unique accept null values where primary key does not allow null values )
create table unique_constraint (
    s_id int primary key,
    t_id int unique 
);

 * mysql+pymysql://root:***@127.0.0.1/test
(pymysql.err.OperationalError) (1050, "Table 'unique_constraint' already exists")
[SQL: # unique ( unique accept null values where primary key does not allow null values )
create table unique_constraint (
    s_id int primary key,
    t_id int unique
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [48]:
%%sql 

desc unique_constraint;

 * mysql+pymysql://root:***@127.0.0.1/test
2 rows affected.

[('s_id', 'int', 'NO', 'PRI', None, ''),
 ('t_id', 'int', 'YES', 'UNI', None, '')]

In [52]:
%%sql 

insert into unique_constraint (s_id, t_id)
values 
(5,5), (4,4), (8, null);

 * mysql+pymysql://root:***@127.0.0.1/test
3 rows affected.

[]

In [53]:
%%sql 

select * from unique_constraint

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[(3, None), (8, None), (2, 1), (1, 2), (4, 4), (5, 5)]

In [54]:
%%sql

# if i need to insert null in primary key

insert into unique_constraint (s_id, t_id)
values 
(null,5)

 * mysql+pymysql://root:***@127.0.0.1/test
(pymysql.err.IntegrityError) (1048, "Column 's_id' cannot be null")
[SQL: # if i need to insert null in primary key

insert into unique_constraint (s_id, t_id)
values
(null,5)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [59]:
%%sql

drop table if exists Sub_Student;
drop table if exists Student_Constraint;

create table Student_Constraint(
    stud_id int,
    n_id int not null,
    name varchar(30) not null,
    roll_no int not null,
    age int,
    city varchar(10) default "Sattur",
    primary key(stud_id),
    unique(n_id),
    check(age >= 18)
);

create table Sub_Student(
    s_id int not null,
    name varchar(20),
    stud_id int,
    primary key(s_id),
    foreign key(stud_id) references Student_Constraint(stud_id)
);

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [60]:
%%sql

desc Student_Constraint

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('stud_id', 'int', 'NO', 'PRI', None, ''),
 ('n_id', 'int', 'NO', 'UNI', None, ''),
 ('name', 'varchar(30)', 'NO', '', None, ''),
 ('roll_no', 'int', 'NO', '', None, ''),
 ('age', 'int', 'YES', '', None, ''),
 ('city', 'varchar(10)', 'YES', '', 'Sattur', '')]

In [61]:
%%sql

desc sub_student;

 * mysql+pymysql://root:***@127.0.0.1/test
3 rows affected.

[('s_id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'YES', '', None, ''),
 ('stud_id', 'int', 'YES', 'MUL', None, '')]

In [62]:
%%sql 

insert into Student_Constraint
values
    (1,101, "Vasan", 20001, 21,"Madurai"),
    (2,102, "Gopi Kannan",20002, 25,"Sattur"),
    (3,103, "Sam",20003, 28,"Sivakasi"),
    (4,104, "Suresh",20004, 32,default),
    (5,105, "Keerthi",20005, 30,"Chennai");

insert into sub_student
values
    (10, "Anand", 1),
    (20, "Aakash", 2),
    (30, "Aravind", 3),
    (40, "Agilan", 4),
    (50, "Avinash", 5);

 * mysql+pymysql://root:***@127.0.0.1/test
5 rows affected.
5 rows affected.

[]

In [63]:
%%sql 

select * from Student_Constraint;

 * mysql+pymysql://root:***@127.0.0.1/test
5 rows affected.

[(1, 101, 'Vasan', 20001, 21, 'Madurai'),
 (2, 102, 'Gopi Kannan', 20002, 25, 'Sattur'),
 (3, 103, 'Sam', 20003, 28, 'Sivakasi'),
 (4, 104, 'Suresh', 20004, 32, 'Sattur'),
 (5, 105, 'Keerthi', 20005, 30, 'Chennai')]

In [64]:
%%sql 

select * from sub_student;

 * mysql+pymysql://root:***@127.0.0.1/test
5 rows affected.

[(10, 'Anand', 1),
 (20, 'Aakash', 2),
 (30, 'Aravind', 3),
 (40, 'Agilan', 4),
 (50, 'Avinash', 5)]

In [65]:
%%sql 

insert into Student_Constraint
values
    (5,105, "Kumar", ,40);

# here we cant able to insert because of that constraints

 * mysql+pymysql://root:***@127.0.0.1/test
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ',40)' at line 3")
[SQL: insert into Student_Constraint
values
    (5,105, "Kumar", ,40);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [66]:
%%sql

# we can change the constraint of a column by using alter command
alter table Student_Constraint
modify column age int not null;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [67]:
%%sql 

desc Student_Constraint;

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('stud_id', 'int', 'NO', 'PRI', None, ''),
 ('n_id', 'int', 'NO', 'UNI', None, ''),
 ('name', 'varchar(30)', 'NO', '', None, ''),
 ('roll_no', 'int', 'NO', '', None, ''),
 ('age', 'int', 'NO', '', None, ''),
 ('city', 'varchar(10)', 'YES', '', 'Sattur', '')]

In [68]:
%%sql 

# we can drop primary key from the table 
alter table Student_Constraint
drop primary key;

 * mysql+pymysql://root:***@127.0.0.1/test
(pymysql.err.OperationalError) (1553, "Cannot drop index 'PRIMARY': needed in a foreign key constraint")
[SQL: # we can drop primary key from the table
alter table Student_Constraint
drop primary key;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [69]:
%%sql 

desc Student_Constraint;

 * mysql+pymysql://root:***@127.0.0.1/test
6 rows affected.

[('stud_id', 'int', 'NO', 'PRI', None, ''),
 ('n_id', 'int', 'NO', 'UNI', None, ''),
 ('name', 'varchar(30)', 'NO', '', None, ''),
 ('roll_no', 'int', 'NO', '', None, ''),
 ('age', 'int', 'NO', '', None, ''),
 ('city', 'varchar(10)', 'YES', '', 'Sattur', '')]

In [70]:
%%sql

# index
create index student_index
on Student_Constraint(stud_id, name, age, city)

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [71]:
%%sql

# Unique Index
create index Unique_student_index
on Student_Constraint(stud_id, n_id, roll_no)

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [72]:
%%sql

show index from Student_Constraint;

 * mysql+pymysql://root:***@127.0.0.1/test
9 rows affected.

[('student_constraint', 0, 'PRIMARY', 1, 'stud_id', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('student_constraint', 0, 'n_id', 1, 'n_id', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('student_constraint', 1, 'student_index', 1, 'stud_id', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('student_constraint', 1, 'student_index', 2, 'name', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('student_constraint', 1, 'student_index', 3, 'age', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('student_constraint', 1, 'student_index', 4, 'city', 'A', 5, None, None, 'YES', 'BTREE', '', '', 'YES', None),
 ('student_constraint', 1, 'Unique_student_index', 1, 'stud_id', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('student_constraint', 1, 'Unique_student_index', 2, 'n_id', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None),
 ('student_constraint', 1, 'Unique_student_index', 3, 'roll_no', 'A', 5, None, None, '', 'BTREE', '', '', 'YES', None)]

In [73]:
%%sql

SHOW CREATE TABLE Student_Constraint;

 * mysql+pymysql://root:***@127.0.0.1/test
1 rows affected.

[('Student_Constraint', "CREATE TABLE `student_constraint` (\n  `stud_id` int NOT NULL,\n  `n_id` int NOT NULL,\n  `name` varchar(30) NOT NULL,\n  `roll_no` int NOT NULL,\n   ... (216 characters truncated) ... `n_id`,`roll_no`),\n  CONSTRAINT `student_constraint_chk_1` CHECK ((`age` >= 18))\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci")]

In [74]:
%%sql

alter table Student_Constraint
drop index student_index;

 * mysql+pymysql://root:***@127.0.0.1/test
0 rows affected.

[]

In [75]:
%%sql

SHOW CREATE TABLE Student_Constraint;

 * mysql+pymysql://root:***@127.0.0.1/test
1 rows affected.

[('Student_Constraint', "CREATE TABLE `student_constraint` (\n  `stud_id` int NOT NULL,\n  `n_id` int NOT NULL,\n  `name` varchar(30) NOT NULL,\n  `roll_no` int NOT NULL,\n   ... (160 characters truncated) ... `n_id`,`roll_no`),\n  CONSTRAINT `student_constraint_chk_1` CHECK ((`age` >= 18))\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci")]